Autodesk.Revit.UI.RebarShapeUIUtil.EditRebarShapeFamily(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Edit and activate the document for a rebar shape family.
document:
The currently active Document.
rebarShapeId:
The id of the rebar shape family to edit.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document has an open editing transaction and is accepting changes.
-or-
document is read-only: It cannot be modified.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The input id is not for an editable loaded family or the input id is for an in-place family.
Since:
2015

Autodesk.Revit.UI.RebarShapeUIUtil
The utility class mainly used for rebar shape operations.
Since:
2015